[
  {
    "id": 0,
    "position_title": "Web Developer",
    "company_name": "Archicoders",
    "company_location": "Imus, Cavite",
    "startedAt": "December 2024",
    "endAt": "Present",
    "description": [
      "Built and maintained multiple WordPress websites using HTML, CSS, JavaScript, Elementor, WooCommerce, and light PHP coding to enhance design and functionality.",
      "Integrated third-party APIs, including Stripe custom checkout flows, focusing on front-end setup, styling, and seamless user experience.",
      "Performed basic SEO configuration using Yoast and optimized websites to achieve high PageSpeed performance scores.",
      "Developed and customized WooCommerce stores and multi-step/conditional forms (JetFormBuilder) for calculations, data collection, and improved site interactivity.",
      "Delivered minimal Webflow websites, customizing templates for responsive and fast-loading pages.",
      "Collaborated via non-voice channels with designers, project managers, team leads, and clients to troubleshoot issues, apply post-handover fixes, and ensure smooth website performance."
    ],
    "skills": [
      "HTML",
      "CSS",
      "PHP",
      "JavaScript",
      "Wordpress",
      "Elementor",
      "Webflow",
      "GSAP"
    ]
  },
  {
    "id": 0,
    "position_title": "Front End Developer",
    "company_name": "Netlingo Support Service Inc.",
    "company_location": "Makati",
    "startedAt": "Nov 2022",
    "endAt": "August 2024",
    "description": [
      "Developed responsive, pixel-perfect websites using HTML, CSS, JavaScript, AngularJS, Vue 3, and jQuery based on Figma and client mockups.",
      "Assisted in migrating company platforms to Vue 3, creating modular and reusable components for improved scalability.",
      "Implemented custom payment solutions via APIs, ensuring secure and efficient transactions for client websites.",
      "Worked closely with designers, QA teams, project managers, and team leads to troubleshoot issues, enhance cross-browser compatibility, and improve user experience."
    ],
    "skills": [
      "HTML",
      "CSS",
      "PHP",
      "JavaScript",
      "AngularJS",
      "Vue3",
      "jQuery",
      "Bootstrap",
      "SASS",
      "Git",
      "Figma",
      "Photoshop"
    ]
  },
  {
    "id": 1,
    "position_title": "Intern Web Developer",
    "company_name": "Altus Tech IT Solutions",
    "company_location": "Bulacan",
    "startedAt": "April 2022",
    "endAt": "June 2022",
    "description": [
      "Supported website development using HTML, CSS, JavaScript, and PHP under the guidance of senior developers.",
      "Assisted in small feature implementations, styling updates, and bug fixes for client projects.",
      "Participated in team code reviews and feedback sessions, gaining best practices for web development and debugging."
    ],
    "skills": [
      "HTML",
      "CSS",
      "JavaScript",
      "Bootstrap",
      "PHP",
      "Laravel",
      "Photoshop"
    ]
  }
]
